/*
 Navicat Premium Data Transfer

 Source Server         : MySQL
 Source Server Type    : MySQL
 Source Server Version : 80023 (8.0.23)
 Source Host           : localhost:3306
 Source Schema         : speedway

 Target Server Type    : MySQL
 Target Server Version : 80023 (8.0.23)
 File Encoding         : 65001

 Date: 10/12/2025 22:58:30
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for charging_station
-- ----------------------------
DROP TABLE IF EXISTS `charging_station`;
CREATE TABLE `charging_station`  (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `lon` double NOT NULL COMMENT '经度',
  `lat` double NOT NULL COMMENT '纬度',
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '名称',
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '地址',
  `pname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '省份',
  `cityname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '城市',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 201 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of charging_station
-- ----------------------------
INSERT INTO `charging_station` VALUES (1, 116.341364, 40.048637, '昆仑网电汽车充电站(中国石油北京蓝天西小口停车场充电场站)', '小营西小口路27号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (2, 116.347374, 40.053895, '小桔充电汽车充电站(西三旗超级充电站)', '西三旗育新花园南50米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (3, 116.327906, 40.03583, '云快充汽车充电站(清河小营超级充电站)', '小营西路31号院南大门西侧停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (4, 116.25427, 40.067196, '中国石化汽车充电站(永丰科技园充电站)', '西北旺镇永丰科技园丰智东路5号汉庭优佳酒店院内', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (5, 116.31593, 39.98141, '北京车联网汽车充电站(中关村e世界)', '海淀街道中关村大街24号(中关村地铁站D西南口步行260米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (6, 116.294822, 39.916822, '汽车充电站(石化易电万寿路物美站)', '万寿路街道物美大卖场(万寿路店)地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (7, 116.308722, 39.934034, '能加超充超级充电站(花园桥外文大厦超充站·华为超充技术支持)', '西三环北路89号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (8, 116.343325, 39.948938, '能加超充超级充电站(交通大学超充站·华为超充技术支持)', '北京交通大学', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (9, 116.348334, 40.054252, '特来电目的地充电站(西三旗充电站)', '育新花园东北2门南240米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (10, 116.352823, 39.977724, '特瓦特超级充电站(学院国际)', '知春路1号学院国际大厦地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (11, 116.266091, 39.929222, '小桔充电汽车充电站(BP快速充电站北京海淀田村路23号院)', '田村路街道长荣酒店(半壁店)地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (12, 116.207754, 39.982213, '昆仑网电汽车充电站(中国石油巨山农场充电站)', '香山南路74-86号香山巨山农场1号停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (13, 116.303337, 39.992534, '昆仑网电汽车充电站(中国石油畅春园充电站)', '清溪书屋路畅春新园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (14, 116.320949, 39.976405, '小桔汽车充电站(北京海淀银网中心充电站)', '中关村街道知春路银网中心地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (15, 116.312593, 40.017012, '中国石化汽车充电站(二河开充电站)', '青龙桥街道二河开21号艺术区', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (16, 116.276832, 39.950235, '中国石化汽车充电站(中关村军民融合充电站)', '昆明湖南路51号中关村军民融合产业园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (17, 116.290659, 39.959697, '特来电汽车充电站(特来电北京市海淀区金源燕莎充电站)', '曙光街道西顶路花园广场地面停车场(长春桥地铁站A西北口步行330米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (18, 116.293692, 40.040894, '能加超充超级充电站(东北旺百旺绿荫超充站·华为超充技术支持)', '百旺绿茵', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (19, 116.347932, 40.05416, '星星充电汽车充电站(星星充电-西三旗快速充电站)', '西三旗街道胜达体育中心育新花园(育新花园西路)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (20, 116.276176, 39.910922, '国家电网汽车充电站(五棵松北路)', '华熙Live五棵松地下停车场B2层A2西区A2-136', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (21, 116.31508, 39.986023, '汽车充电站(隆瑞三优中海电子快充站)', '海淀路27号(中关村地铁站A1西北口步行400米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (22, 116.185712, 40.043001, '星星充电汽车充电站(北京海淀区-白家疃尚品园)', '白家疃尚品园地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (23, 116.337809, 40.052076, '中国石化汽车充电站(悦秀路充电站)', '西三旗街道悦秀路77号蓝天停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (24, 116.3098, 39.894247, '云快充汽车充电站(北京海淀悦邻生活广场充电站)', '西三环中路吴家场路1号院甲1号楼', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (25, 116.2767, 39.956378, '云快充汽车充电站(萌动地带六合居超充站)', '远大路52号六合居餐饮地上停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (26, 116.283125, 39.910328, '极狐汽车充电站(五棵松冰上中心)', '华熙LIVE·冰上中心地上停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (27, 116.308835, 40.041747, '能加超充超级充电站(上地创业路超充站·华为超充技术支持)', '上地如家酒店', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (28, 116.292745, 39.911624, '小桔充电汽车充电站(BP快速充电站北京海淀万寿宾馆)', '万寿宾馆根据定位导航即可到达充电站入口', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (29, 116.182149, 40.088994, '万马爱充汽车充电站(万马爱充稻香湖景酒店站)', '稻香湖路稻香湖酒店', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (30, 116.33933, 39.99192, '特来电超级充电站(特来电北京市海淀区五道口购物中心充电站)', '学院路街道五道口购物中心(五道口地铁站B南口步行240米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (31, 116.296034, 40.057706, '万马爱充汽车充电站(万马爱充东大停车场站北区)', '上地西路与G7京新高速出口交叉口西南50米地面停车场E270', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (32, 116.373082, 40.031626, '能加超充超级充电站(黑泉路芳清园超充站·华为超充技术支持)', '东升镇芳清园小区8号楼底商停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (33, 116.29751, 40.047405, '特斯拉超级充电站(北京中关村软件园)', '中关村软件园汉王大厦对面(入口云盘南街)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (34, 116.302024, 39.974401, '特斯拉超级充电站(北京市海润大厦)', '海淀南路36号地面停车场(苏州街地铁站A西北口步行370米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (35, 116.276529, 39.923332, '星星充电汽车充电站(海淀区-定慧产业园)', '八里庄街道西四环中路辅路集美家居定慧桥商场地面停车场85', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (36, 116.270996, 40.014137, '壳牌汽车充电站(壳牌安河桥北商业楼充电站)', '龙背村路101号物美超市B2层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (37, 116.234605, 40.084997, '国家电网汽车充电站(北京市海淀区大牛坊小区)', '西北旺镇大牛坊小区一期北侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (38, 116.27701, 40.028404, '昆仑网电汽车充电站(中国石油北京海淀中发百旺停车楼充电站)', '圆明园西路18号中发百旺商城南停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (39, 116.269329, 40.079268, '特来电汽车充电站(北京航天城社区充电站)', '友谊路102号院', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (40, 116.296501, 40.055302, '万马爱充汽车充电站(万马爱充东大停车场站南区)', '上地西路与G7京新高速出口交叉口西南50米东地面停车场A317', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (41, 116.347127, 40.053817, '云快充汽车充电站(华为西三旗充电站)', '西三旗育新花园南50米快速充电站', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (42, 116.32158, 39.905163, '昆仑网电汽车充电站(昆仑网电北京恩菲大厦院外充电站)', '复兴路戊12号恩菲大厦西门建设银行南侧路边', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (43, 116.367147, 39.954826, '蔚享天成汽车充电站(小团子充电站)', '志强北园小区2号楼', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (44, 116.3373, 40.035904, '国家电网汽车充电站(北京市海淀区和盈大厦公共充电站)', '清河朱房路临甲68号北京合盈科技发展有限公司', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (45, 116.308804, 39.953132, '云快充汽车充电站(久凌大厦南楼充电站)', '西三环北路21号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (46, 116.356354, 39.950422, '华商三优汽车充电站(扬招站海淀区节能大厦优易充小站)', '西直门北大街道路东侧', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (47, 116.33433, 39.89799, '昆仑网电汽车充电站(昆仑网电北京中土大厦充电站)', '北蜂窝6号东门进入到头左转停车场出口岗亭旁边', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (48, 116.31882, 39.971153, '特来电汽车充电站(特来电人大文化科技园充电站)', '海淀街道文化大厦中国人民大学文化科技园地面及B1停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (49, 116.315092, 39.912655, '国家电网汽车充电站(北京市海淀区宋庆龄基金会北侧公共充电站)', '玉渊潭南路11号院宋庆龄儿童科技馆北侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (50, 116.30857, 39.979805, '派捷充汽车充电站(一加一大厦充电站)', '彩和坊路10号地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (51, 116.303734, 40.056717, '昆仑网电汽车充电站(中国石油西二旗桥大场超充站)', '西北旺镇上地东路(领秀新硅谷C区)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (52, 116.33504, 39.962272, '华商三优汽车充电站(海淀区皂君庙路东侧40016充电扬招站)', '皂君庙路道路东侧,交大附中西门南侧', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (53, 116.32469, 39.897636, '能加超充汽车充电站(北京西客站充电站)', '北蜂窝路43号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (54, 116.232389, 40.119971, '国家电网汽车充电站(北京市海淀区玉带河)', '沙阳路南100米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (55, 116.22096, 39.993782, '国家电网汽车充电站(北京市海淀区香山公园2号停车场充电站)', '香山公园2号停车场(香泉环岛西北角)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (56, 116.30875, 39.96363, '理想汽车超级充电站(理想超充站北京西海国际中心)', '西海国际中心停车场(苏州桥地铁站B口步行120米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (57, 116.22949, 40.090233, '逸安启超级充电站(逸安启超充站-北京海淀大悦城)', '大牛房二巷南大悦城地下停车场北入口B2层H区,近H006号车位', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (58, 116.25884, 39.928375, '特来电汽车充电站(橡胶院充电站)', '田村路街道田村路40号院橡胶院小区', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (59, 116.266788, 40.037892, '国家电网汽车充电站(北京市海淀区金望泽)', '西北旺镇金望泽花卉综合市场地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (60, 116.368154, 39.978252, '国家电网汽车充电站(中关村数字产业园)', '牡丹园地铁站F口步行360米地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (61, 116.380634, 39.976396, '星星充电汽车充电站(绿城未来-健德门充电站)', '花园路街道健德商务楼(健德门地铁站D西南口步行100米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (62, 116.291287, 39.996902, '特斯拉超级充电站(北京龙湖星悦荟)', '颐和园路208号龙湖星悦荟地下停车场B1/08-19车位', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (63, 116.328155, 39.938279, '充小兽汽车充电站(腾达大厦站)', '腾达大厦(西直门外大街南)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (64, 116.337138, 40.047846, '特斯拉超级充电站(北京通厦公元99)', '悦秀路99号地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (65, 116.3467, 39.95847, '国家电网汽车充电站(海淀区学院南路33号充电站)', '学院南路33号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (66, 116.28244, 39.91154, '云快充汽车充电站(华熙LIVE·五棵松店)', '五棵松文化体育中心华熙写字楼A座地下二层停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (67, 116.216471, 40.123212, '国家电网汽车充电站(北京市海淀区馨瑞嘉园公共充电站)', '上庄镇馨瑞东路馨瑞嘉园地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (68, 116.313899, 39.924228, '华商三优汽车充电站(扬招站海淀区北京工商大学西校区优易充小站)', '阜成路道路北侧北京工商大学西校区图书馆附近', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (69, 116.241458, 40.070393, '国家电网汽车充电站(北京市海淀区用友软件园公共充电站)', '中科院光电技术所食堂楼地面停车场032', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (70, 116.277062, 40.028481, '小桔充电汽车充电站(京能超级充电站中发百旺站)', '汽车充电站(京能超级充电站中发百旺站)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (71, 116.34229, 39.976963, '小桔充电汽车充电站(首发能源静态交通大运村停车楼充电站)', '知春路和大运村路交叉口西北停车楼', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (72, 116.32326, 40.043465, '小桔充电汽车充电站(中石化龙禹安宁庄润滑油充电站)', '清河街道新北口腔(清河分院)中国石化润滑油有限公司', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (73, 116.278743, 39.963852, '小桔充电汽车充电站(北京海淀世纪华天酒店充电站)', '曙光街道北京世纪华天大酒店地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (74, 116.275058, 40.062915, '小桔充电汽车充电站(北京海淀唐家岭红英小学南充电站)', '西北旺镇土井村路甲49号东居物业一库区地面停车场(最东侧)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (75, 116.365674, 39.99432, '小桔充电汽车充电站(志新路11号院充电站)', '志新路11号立体停车场(入口)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (76, 116.309715, 40.03633, '小桔充电汽车充电站(上地金融科贸大厦-鲸悦能源超充站)', '金隅嘉华大厦南门东190米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (77, 116.276327, 39.928177, '小桔充电汽车充电站(天潮能充·定慧里液冷超充站)', '定慧福里南区北1门西140米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (78, 116.291748, 39.947377, '小桔充电汽车充电站(北京海淀嘉豪国际充电站)', '嘉豪国际中心西地面停车场(车道沟地铁站D西南口步行190米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (79, 116.275868, 39.933047, '小桔充电汽车充电站(北京海淀区五路居里程宝超级电站)', '八里庄街道海淀五路居地铁站A西北口物美慧科大厦地面停车场(入口直行30米右转即到)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (80, 116.229573, 40.120147, '北玉带河村公共充电站', '沙阳路与梅所屯路交叉口东440米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (81, 116.30398, 40.05606, '小桔充电汽车充电站(智电速能上地东路西二旗桥充电站)', '上地街道上地东路(西二旗地铁站A2北出口步行440米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (82, 116.245077, 40.050317, '小桔充电汽车充电站(北京海淀西山锦绣府地上充电站)', '西北旺镇亮甲店路9号院西北旺锦绣汇C座B3层直行右转', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (83, 116.260664, 39.907077, '小桔充电汽车充电站(北京海淀嘉德公寓充电站)', '复兴路甲38-6号苏宁易购复兴路店停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (84, 116.14548, 40.082268, '小桔充电汽车充电站(海淀柳林村朋博产业园超充站)', '苏家坨镇朋博产业园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (85, 116.317986, 39.954937, '小桔充电汽车充电站(北京市海淀区魏公村佳苑充电站)', '紫竹院街道魏公村(北区)魏公村佳苑B3层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (86, 116.254078, 39.97907, '小桔充电汽车充电站(海淀区北坞创新园超级充电站)', '四季青镇北坞创新园南区3号园区西侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (87, 116.282376, 39.900951, '小桔充电汽车充电站(北京海淀今日家园充电站)', '今日家园商业中心地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (88, 116.33435, 40.057852, '小桔充电汽车充电站(北京海淀沁春汇充电站)', '北京·沁春汇地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (89, 116.334961, 40.029621, '小桔充电汽车充电站(清河万象汇充电站)', '清河街道朱房路12号北京清河万象汇东区立体停车场上二层直行到头', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (90, 116.2795, 39.95296, '小桔充电汽车充电站(北京世纪金源大饭店淘淘充超级充电站)', '世纪金源大饭店地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (91, 116.303856, 39.90876, '小桔充电汽车充电站(优智翠微大厦东区充电站)', '羊坊店街道翠微东三条翠微大厦', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (92, 116.235767, 40.07904, '小桔充电汽车充电站(北京海淀区北科永丰产业园)', '西北旺镇北京科学技术研究院现代制造技术产业园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (93, 116.342505, 39.976981, '北京市海淀区大运村立体停车设施光储充站', '知春路地铁站F口西北30米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (94, 116.277174, 39.958007, '北京倪氏海泰大酒店(简单冲)', '厂西门中街与厂西门南路交叉口西140米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (95, 116.296793, 40.024751, '小桔充电汽车充电站(北京博雅西园)', '北京博雅西园小区底商东侧', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (96, 116.326483, 39.966862, '双安东充电站', '北三环西路36号(人民大学地铁站F口步行300米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (97, 116.343064, 39.968082, '华商三优汽车充电站(扬招站海淀区大钟寺家居广场优易充小站)', '北三环西路23-1号(大钟寺地铁站E口步行100米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (98, 116.288825, 39.957214, '华商三优汽车充电站(扬招站海淀区远大路优易充小站)', '远大路鲁园上河村(长春桥地铁站D2西南口步行380米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (99, 116.228226, 39.94188, '小桔充电汽车充电站(北京海淀四季青生命科技园超充站)', '巨山路与永引渠北路交叉口东北80米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (100, 116.23542, 39.955418, '小桔充电汽车充电站(西山商业大厦充电站)', '西山商业大厦停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (101, 116.354457, 39.988197, '特斯拉超级充电站(北京科大天工大厦)', '学院路30号科大天工大厦地上停车场(入口学院路)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (102, 116.262856, 39.984272, '国家电网汽车充电站(北京市海淀区颐和园西门)', '颐和园西门地面停车场0297(颐和园西门地铁站出入口步行410米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (103, 116.311165, 39.97954, '小鹏汽车充电站(小鹏超充北京中国电子大厦站)', '丹棱街3号A座中国电子大厦(入口海定中街)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (104, 116.30445, 39.98638, '汽车充电站(扬招站海淀区北四环内环辅路40079优易充小站)', '北四环西路65号-15层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (105, 116.277861, 39.931533, '小桔充电汽车充电站(北京市海淀区玲珑天地充电站)', '金隅大成玲珑天地地面停车场004(出入口)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (106, 116.307044, 39.970982, '华商三优汽车充电站(海淀区苏州街40024充电扬招站)', '苏州街44号(苏州街地铁站D西南口步行440米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (107, 116.289817, 40.044983, '星星充电汽车充电站(星星充电-海淀-千方大厦充电站)', '上地街道软件园三号路千方大厦', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (108, 116.28872, 39.953056, '理想汽车超级充电站(理想5C超充站北京海淀区远大东路近远大园四区)', '曙光街道世纪华联(远大东路)远大园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (109, 116.326846, 39.945558, '国家电网汽车充电站(北京市海淀区中国气象局社区南区公共充电站)', '中国气象局社区南区19号楼北侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (110, 116.355633, 39.953874, '枫蓝国际充电站', '西直门北大街32院', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (111, 116.349411, 39.944874, '华商三优汽车充电站(海淀区高梁桥斜街40045充电扬招站)', '高梁桥斜街道路北侧,北广通商务楼门口', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (112, 116.13728, 40.05184, '国家电网汽车充电站(北京市海淀区汇通诺尔狂飙运动乐园充电站)', '苏家坨镇南安河路1号汇通诺尔狂飙运动乐园停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (113, 116.303475, 39.926221, '特来电汽车充电站(北京304医院充电站)', '阜成路51号地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (114, 116.31591, 39.98108, '理想汽车超级充电站(理想5C超充站北京e世界财富中心)', 'e世界财富中心东地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (115, 116.322761, 39.921982, '北京海军总医院汽车充电站', '阜成路与增阜路交叉口南200米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (116, 116.342668, 39.964019, '开迈斯汽车充电站(北京市海淀区大钟寺怡和8号院站)', '四道口北街大钟寺8号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (117, 116.338423, 39.95697, '特斯拉超级充电站(北京中关村资本大厦)', '学院南路62号地上停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (118, 116.320606, 39.911604, '小桔充电汽车充电站(中华世纪坛充电站)', '羊坊店街道中华世纪坛-中心岛中华世纪坛地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (119, 116.28967, 40.000126, '蔚来能源汽车充电站(北京西苑交通枢纽)', '蔚来换电站北京西苑交通枢纽旁', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (120, 116.32374, 39.95733, '国家电网汽车充电站(北京市海淀区和泓大厦公共充电站)', '中关村南大街12号(魏公村地铁站D西南口步行190米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (121, 116.19343, 40.07249, '新电途汽车充电站(利嘉充电站(海淀区绿地中央广场站))', '中关村创新园(连桥二街北)地下三层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (122, 116.236259, 39.953236, '汽车充电站(益园文创基地)', '杏石口路65号益园餐厅后侧', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (123, 116.17386, 40.04558, '云快充目的地充电站(温泉苗圃-充电站)', '温泉镇温泉苗圃路口东南侧停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (124, 116.337483, 40.014323, '国家电网汽车充电站(北京市海淀区东升花园中心)', 'G7辅路东升花园中心停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (125, 116.272828, 39.943693, '小桔充电汽车充电站(北京金四季购物中心充电站)', '金四季购物中心地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (126, 116.17386, 40.04558, '云快充目的地充电站(温泉苗圃-充电站)', '温泉镇温泉苗圃路口东南侧停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (127, 116.337483, 40.014323, '国家电网汽车充电站(北京市海淀区东升花园中心)', 'G7辅路东升花园中心停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (128, 116.272828, 39.943693, '小桔充电汽车充电站(北京金四季购物中心充电站)', '金四季购物中心地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (129, 116.220941, 39.991711, '隆瑞三优超级充电站(香泉环岛超级充电站)', '香泉环岛1号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (130, 116.28905, 40.046383, '小鹏超级充电站(小鹏S4超快充北京中关村软件园站)', '上地街道软件园四号路中关村软件园(入口环湖西路)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (131, 116.34713, 40.053818, '国家电网汽车充电站(西三旗超级充电站)', '西三旗育新花园南50米西三旗快速充电站', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (132, 116.273659, 39.956684, '能加超充汽车充电站(四季青桥依斯特大厦超充站)', '西四环北路15号地上停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (133, 116.289137, 39.9615, '小桔充电汽车充电站(北京金源时代商务中心淘淘充充电站)', '曙光街道金源时代商务中心地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (134, 116.26063, 40.050056, '逸安启超级充电站(逸安启超充站-北京西北旺万象城)', '马连洼街道德政路16号B3层3区与7区交汇处', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (135, 116.304943, 39.892379, '汽车充电站(佳弘莲花大厦液冷超级充电站统建统服)', '吴家场路与莲怡园东路交叉口东200米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (136, 116.339346, 39.975473, '广汽能源超级充电站(北京翔达大厦)', '知春路甲48号盈都大厦地面停车场07', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (137, 116.138466, 40.079082, '国家电网汽车充电站(北京市海淀区柳林村公共充电站)', '苏家坨镇柳林村柳林村村委会', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (138, 116.255935, 39.973776, '国家电网充电站(海淀区玉泉慧谷二期南侧)', '邓庄路玉泉慧谷2期中国民生银行北京香山支行南侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (139, 116.30437, 39.91265, '小鹏超级充电站(小鹏S4超快充北京印象城翠微店站)', '翠微路12号印象城翠微店B2层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (140, 116.333782, 39.986788, '能加超充超级充电站(保福寺桥银谷大厦超充站·华为超充技术支持)', '银谷大厦', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (141, 116.27608, 39.913647, '理想汽车超级充电站(理想超充站北京五棵松万达广场)', '万达广场北京海淀店地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (142, 116.20231, 40.124134, '汽车充电站(公共站海淀区上庄镇后小营村优易充小站)', '沙阳路150号华联超市停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (143, 116.330086, 40.048214, '理想汽车超级充电站(理想超充站北京泰山饭店)', '泰山饭店停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (144, 116.360338, 39.979754, '国家电网汽车充电站(塔院小区)', '花园路3号塔院小区晴冬园3号楼东侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (145, 116.302769, 40.053542, '小桔充电汽车充电站(华速快充海淀区环洋大厦停车场充电站)', '环洋大厦停车场入口右转(西二旗地铁站A1北入口步行380米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (146, 116.312912, 39.941591, '星星充电汽车充电站(星星充电-人济山庄充电站)', '紫竹院路1号人济山庄(中国移动门口)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (147, 116.32912, 39.995445, '理想汽车超级充电站(理想超充站北京清华科技园创业大厦)', '清华科技园·创业大厦停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (148, 116.336882, 40.046747, '特来电充电站(北京通厦公元99)', '西三旗街道G6辅路通厦·公元99地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (149, 116.310817, 40.05276, '隆瑞三优西二旗362路充电站', '西二旗公共汽车站东南1门旁', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (150, 116.24948, 40.095808, '汽车充电站(公共站海淀区紫星苑小区北门优易充小站)', '西北旺镇皇后店永玉东二路紫星苑', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (151, 116.310817, 40.05276, '隆瑞三优西二旗362路充电站', '西二旗公共汽车站东南1门旁', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (152, 116.24948, 40.095808, '汽车充电站(公共站海淀区紫星苑小区北门优易充小站)', '西北旺镇皇后店永玉东二路紫星苑', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (153, 116.3103, 40.027756, '汽车充电站(卡丘充电-硅谷亮城)', '上地街道农大南路1-5号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (154, 116.302733, 39.974424, '星星充电汽车充电站(海淀艾瑟顿国际公寓)', '海淀南路36号美华海润大厦地下停车场0003', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (155, 116.336075, 39.998577, '爱迪充汽车充电站(北京学研大厦直流站)', '双清路30号清华大学东门学研大厦', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (156, 116.352885, 40.014481, '特斯拉超级充电站(北京学清嘉创大厦)', '学清路银泉路交叉口东南地下B2-B区021-037入口银泉路', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (157, 116.313882, 39.984645, '特来电汽车充电站(鼎好DH3大厦店)', '海淀大街3号鼎好DH3大厦A座B3地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (158, 116.275345, 39.941, '蔚来能源超级充电站(北京海淀五路居)', '营慧寺75号(四季青桥地铁站C口步行410米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (159, 116.313137, 39.996208, '充电侠汽车充电站(北京大学光华管理学院2号楼北侧)', '中关村北大街西200米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (160, 116.27322, 39.942432, '小桔充电汽车充电站(四季慧谷数字产业园超充站)', '金四季购物中心地下停车场(四季青桥地铁站A口步行190米)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (161, 116.36664, 40.041205, '国家电网汽车充电站(北京市海淀区永泰绿色生态园)', '永泰庄北路9号永泰绿色生态园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (162, 116.368021, 39.969373, '壳牌中央新闻纪录电影制片厂充电站(小桔充电)', '中央新闻纪录电影制片厂(集团)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (163, 116.320755, 39.976715, '云快充汽车充电站(海淀银网中心)', '知春路113号银网中心地下车库2层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (164, 116.266195, 40.052623, '国家电网汽车充电站(北京市海淀区夏霖园公共充电站)', '西北旺镇后厂村路夏霖园地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (165, 116.334435, 40.03018, '逸安启超级充电站(逸安启超充站-北京清河万象汇)', '清河中街68号B2层西区(原始车位编号C218-221)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (166, 116.23283, 40.089024, '特斯拉超级充电站(北京智慧谷悦界)', '永润路18号院智慧谷悦界地下停车场B2层B2-248车位旁', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (167, 116.376826, 39.978885, '驴充充汽车充电站(易亨环星汽车充电站北京牡丹园)', '花园北路14号易亨环星科创园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (168, 116.256609, 40.037908, '国家电网汽车充电站(北京市海淀区百望山森林公园北门公共充电站)', '百望山森林公园北门地面停车场083', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (169, 116.268943, 40.049017, '国家电网汽车充电站(北京市海淀区冬晴园)', '西北旺镇后厂村路冬晴园地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (170, 116.211234, 40.128541, '国家电网汽车充电站(北京市海淀区上庄馨悦家园公共)', '上庄路馨悦家园西区院外(西马坊大食堂北侧)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (171, 116.27386, 40.062332, '蔚来能源超级充电站(北京中关村公园)', '土井村路甲49号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (172, 116.270707, 40.0141, '云快充汽车充电站(物美超市安河桥北店)', '马连洼街道龙背村路101号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (173, 116.312282, 39.9098, '特斯拉超级充电站(北京国海广场)', '复兴路17号4号楼公寓旁地面停车场6B', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (174, 116.27956, 40.067095, '国家电网汽车充电站(北京市海淀区唐家岭新城东区公共充电站)', '唐家岭南环路唐家岭新城-东区', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (175, 116.277526, 39.949834, '国家电网充电站(北京市海淀区中关村军民融合产业园公共站)', '中关村军民融合产业园地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (176, 116.312282, 39.9098, '特斯拉超级充电站(北京国海广场)', '复兴路17号4号楼公寓旁地面停车场6B', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (177, 116.27956, 40.067095, '国家电网汽车充电站(北京市海淀区唐家岭新城东区公共充电站)', '唐家岭南环路唐家岭新城-东区', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (178, 116.277526, 39.949834, '国家电网充电站(北京市海淀区中关村军民融合产业园公共站)', '中关村军民融合产业园地下停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (179, 116.28914, 39.9615, '小桔充电汽车充电站(北京金源时代商务中心慢充充电站)', '曙光街道平安银行(北京世纪金源支行)金源时代商务中心地面停车场地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (180, 116.309654, 39.983578, '广汽能源汽车充电站(昊铂北京中关村SOHO超充站)', '北二街8号中关村SOHO地下停车场B2层(2043-2046车位)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (181, 116.23294, 40.08957, '极氪能源超级充电站(北京海淀悦界主题街区极充站)', '大牛房一巷与大牛房二环路交叉口南60米悦界主题街区地下停车场负二层', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (182, 116.322517, 39.942976, '国家电网汽车充电站(北京市海淀区国家图书馆公共)', '中关村南大街33号(仅限预约读者进馆)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (183, 116.309155, 39.984623, '中化新能源汽车充电站(北京中国化工大厦充电站)', '北四环西路62号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (184, 116.20079, 39.995529, '北京首农香山会议中心(简单冲)', '首农香山会议停车场(7号停车场)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (185, 116.33457, 39.962845, '华商三优汽车充电站(海淀区皂君庙路东侧40017充电扬招站)', '皂君庙路道路东侧,交大附中前', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (186, 116.095634, 40.082764, '国家电网汽车充电站(北京市海淀区七王坟村公共充电站)', '苏家坨镇七王坟村', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (187, 116.331268, 39.9948, '爱迪充汽车充电站(清华科技园快充站)', '清华园街道中关村东路清华科技园', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (188, 116.314285, 39.978966, '特斯拉超级充电站(北京中关村领展)', '丹棱街甲1号地下停车场B3层D区3020-3022车位(入口丹棱街)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (189, 116.332038, 39.994041, '特斯拉超级充电站(北京清华科技园)', '中关村东路1号清华科技园阳光厅地下停车场B2层218车位旁/入口中关村东路', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (190, 116.3095, 39.984344, '小鹏汽车充电站(小鹏超充北京理想国际大厦站)', '海淀中街与海淀北一街交叉口西北60米地下停车场345', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (191, 116.157099, 40.065165, '北京翠湖科技园(简单冲)', '高里掌路与温阳路交叉口西460米', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (192, 116.326593, 39.933048, '云快充汽车充电站(安速充国兴大厦公牛超级充电站)', '首都体育馆南路22号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (193, 116.229568, 40.092196, '汽车充电站(北京海淀大悦城岚图汽车智慧超充站)', '永润路18号', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (194, 116.253023, 39.97508, '国家电网汽车充电站(北京市海淀区北坞嘉园充电站)', '闵庄路北坞嘉园地面停车场0023', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (195, 116.2016, 40.040173, '云快充汽车充电站(温泉中心卫生院-充电站)', '温泉镇中心卫生院内东侧', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (196, 116.197062, 40.124925, '驴充充汽车充电站(罗家村电动汽车充电站)', '罗家坟村停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (197, 116.299639, 40.055954, '国家电网汽车充电站(北京市海淀区上地西街东大停车场公共充电站SDK)', '后厂村路北侧东大停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (198, 116.279627, 40.021538, '特来电汽车充电站(农大家属院充电站)', '圆明园西路三号院16号楼西侧地面停车场', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (199, 116.351135, 40.00014, '云快充汽车充电站(弘彧大厦汽车直流充电站)', '弘彧大厦地上充电站大厦西侧(对外开放)', '北京市', '北京市');
INSERT INTO `charging_station` VALUES (200, 116.2502, 40.0681, '蔚来能源超级充电站(北京朗丽兹西山花园酒店)', '丰智东路13号(永丰南地铁站B东北口步行400米)', '北京市', '北京市');

SET FOREIGN_KEY_CHECKS = 1;
